#coding:utf-8

'''
因此√2的前十个逼近值为：

1, 3/2, 7/5, 17/12, 41/29, 99/70, 239/169, 577/408, 1393/985, 3363/2378, …

最令人惊讶的莫过于重要的数学常数e有如下连分数表示
e = [2; 1,2,1, 1,4,1, 1,6,1 , … , 1,2k,1, …]。

e的前十个逼近值为：

2, 3, 8/3, 11/4, 19/7, 87/32, 106/39, 193/71, 1264/465, 1457/536, …

第10个逼近值的分子各位数字之和为1+4+5+7=17。

求e的第100个逼近值的分子各位数字之和。
'''

d = [[1,2,3]]
f = [[1,3,4]]

for i in range(0,32):
    d0 = []
    f0 = []
    d0.append(d[i][1]+d[i][2])
    f0.append(f[i][1]+f[i][2])
    d0.append(d0[0] * 2 * (i+2) + d[i][2])
    f0.append(f0[0] * 2 * (i+2) + f[i][2])
    d0.append(d0[0] + d0[1])
    f0.append(f0[0] + f0[1])
    d.append(d0)
    f.append(f0)

print sum(map(int,list(str(f[32][2] * 2 + d[32][2]))))
print sum(int(i) for i in str(f[32][2] * 2 + d[32][2]))
